:PROPERTIES:
:ID:       40dcb082-52a4-436c-b13a-975d3bd27cef
:END:
#+TITLE: Orange Pi: Firmware, u-boot, rkdevtool and SPI Flash
#+CATEGORY: slips
#+TAGS:

#+begin_quote
The =rkdeveloptool= commands here just provide a reference for options. They
aren't necessarily configuring anything. Just adding this caveat.
#+end_quote

**** Base RK35888

#+begin_src shell :results output verbatim code :wrap example conf
cat $obtmp/rkbin/RKBOOT/RK3588MINIALL.ini
#+end_src

#+RESULTS:
#+begin_example conf
[CHIP_NAME]
NAME=RK3588
[VERSION]
MAJOR=1
MINOR=11
[CODE471_OPTION]
NUM=1
Path1=bin/rk35/rk3588_ddr_lp4_2112MHz_lp5_2400MHz_v1.19.bin
Sleep=1
[CODE472_OPTION]
NUM=1
Path1=bin/rk35/rk3588_usbplug_v1.11.bin
[LOADER_OPTION]
NUM=2
LOADER1=FlashData
LOADER2=FlashBoot
FlashData=bin/rk35/rk3588_ddr_lp4_2112MHz_lp5_2400MHz_v1.19.bin
FlashBoot=bin/rk35/rk3588_spl_v1.13.bin
[OUTPUT]
PATH=rk3588_spl_loader_v1.19.113.bin
[SYSTEM]
NEWIDB=true
[FLAG]
471_RC4_OFF=true
RC4_OFF=true
[BOOT1_PARAM]
WORD_0=0x0
WORD_1=0x0
WORD_2=0x0
WORD_3=0x0
WORD_4=0x0
WORD_5=0x0
WORD_6=0x0
WORD_7=0x0
#+end_example

***** IPC

#+begin_src shell :results output verbatim code :wrap example diff
diff $obtmp/rkbin/RKBOOT/RK3588MINIALL{,_IPC}.ini
#+end_src

#+RESULTS:
#+begin_example diff
20c20,21
< PATH=rk3588_spl_loader_v1.19.113.bin
---
> PATH=rk3588_download_v1.19.113.bin
> IDB_PATH=rk3588_idblock_v1.19.113.img
25a27
> CREATE_IDB=true
#+end_example

***** PCIE_EP

#+begin_src shell :results output verbatim code :wrap example diff
diff $obtmp/rkbin/RKBOOT/RK3588MINIALL{,_PCIE_EP}.ini
#+end_src

#+RESULTS:
#+begin_example diff
17,18c17,18
< FlashData=bin/rk35/rk3588_ddr_lp4_2112MHz_lp5_2400MHz_v1.19.bin
< FlashBoot=bin/rk35/rk3588_spl_v1.13.bin
---
> FlashData=bin/rk35/rk3588_pcie_v2.20.bin
> FlashBoot=bin/rk35/rk3588_pcie_v2.20.bin
20c20
< PATH=rk3588_spl_loader_v1.19.113.bin
---
> PATH=rk3588_pcie_loader_v2.20.bin
26,34c26
< [BOOT1_PARAM]
< WORD_0=0x0
< WORD_1=0x0
< WORD_2=0x0
< WORD_3=0x0
< WORD_4=0x0
< WORD_5=0x0
< WORD_6=0x0
< WORD_7=0x0
---
> CREATE_IDB=true
#+end_example

***** RAMBOOT

Nics.... =null{0,1}.bin=

#+begin_src shell :results output verbatim code :wrap example diff
diff $obtmp/rkbin/RKBOOT/RK3588MINIALL{,_RAMBOOT}.ini
#+end_src

#+RESULTS:
#+begin_example diff
5c5
< MINOR=11
---
> MINOR=6
12c12
< Path1=bin/rk35/rk3588_usbplug_v1.11.bin
---
> Path1=bin/rk35/rk3588_ramboot_v1.06.bin
17,18c17,18
< FlashData=bin/rk35/rk3588_ddr_lp4_2112MHz_lp5_2400MHz_v1.19.bin
< FlashBoot=bin/rk35/rk3588_spl_v1.13.bin
---
> FlashData=bin/rk35/rk3588_ramboot_null0.bin
> FlashBoot=bin/rk35/rk3588_ramboot_null1.bin
20c20
< PATH=rk3588_spl_loader_v1.19.113.bin
---
> PATH=rk3588_ramboot_loader_v1.19.106.bin
26,34d25
< [BOOT1_PARAM]
< WORD_0=0x0
< WORD_1=0x0
< WORD_2=0x0
< WORD_3=0x0
< WORD_4=0x0
< WORD_5=0x0
< WORD_6=0x0
< WORD_7=0x0
#+end_example
*** Binwalk

=binwalk -Me $fullimg=

#+begin_example text
Scan Time:     2025-04-08 19:02:25
Target File:   full-spi.img
MD5 Checksum:  9881c035932b9e31dc22be03c4700e80
Signatures:    411

DECIMAL       HEXADECIMAL     DESCRIPTION
--------------------------------------------------------------------------------
253624        0x3DEB8         CRC32 polynomial table, little endian
328280        0x50258         Flattened device tree, size: 6809 bytes, version: 17
524288        0x80000         Flattened device tree, size: 1975 bytes, version: 17
1335116       0x145F4C        CRC32 polynomial table, little endian
1429259       0x15CF0B        Android bootimg, kernel size: 1919249152 bytes, kernel addr: 0x5F6C656E, ramdisk size: 1919181921 bytes, ramdisk addr: 0x5700635F, product name: ""
1997312       0x1E7A00        Flattened device tree, size: 21304 bytes, version: 17
2146304       0x20C000        Flattened device tree, size: 13605 bytes, version: 17
#+end_example

So there are four device trees. Then, with =binwalk -cf $csv -e $fullimg=

#+begin_src sh :results output code :wrap example sh :eval query
p=/tmp/tmp.WJgyO3457v
img=full.img
csv=/tmp/fdsa.log
i=0
grep -e device $csv |\
    sed -E 's/([0-9]+),.*size: ([0-9]+) bytes.*/\1 \2/g' |\
while read dtoffset dtsize; do
  i="$((i + 1))"
#  echo $i: $dtoffset $dtsize
  fname="$p/$(basename $p/$img .img).$i.dtb"
  echo dd if=$p/$img of=$fname bs=1 skip=$dtoffset count=$dtsize
done
#+end_src

#+RESULTS:
#+begin_example sh
dd if=/tmp/tmp.WJgyO3457v/full.img of=full.1.dtb bs=1 skip=328280 count=6809
dd if=/tmp/tmp.WJgyO3457v/full.img of=full.2.dtb bs=1 skip=524288 count=1975
dd if=/tmp/tmp.WJgyO3457v/full.img of=full.3.dtb bs=1 skip=1997312 count=21304
dd if=/tmp/tmp.WJgyO3457v/full.img of=full.4.dtb bs=1 skip=2146304 count=13605
#+end_example

... and copy the =dd= commands and run.

** Babel

#+name: spiPath
#+begin_src emacs-lisp :eval query :cache yes
(setq-local spi-path (or (bound-and-true-p spi-path)
                         (read-string "SPI path: " (make-temp-file "spi-" t))))
#+end_src

#+RESULTS[c8bf8b1f4e9255aefd0f4f9f3671f961bb8a067b]: spiPath
: /tmp/spi-6djkEd

Start a session.

+ For some reason, =guix shell= without clearing out =GUIX_PROFILE= is setting up
  the path incorrectly (babel is doing something else). Using =--pure= leaves me
  without some essential tools.
+ =:dir spiPath= isn't working...

# +header: :dir spiPath

#+begin_src sh :session *spi* :eval query :async yes :var spiPath=spiPath
cd $spiPath
pkgs=(rkdeveloptool binwalk)
guix shell ${pkgs[@]}

# fix path
PATH=${GUIX_ENVIRONMENT}/bin:$PATH
#+end_src

#+RESULTS:
: bash: bind: warning: line editing not enabled
: bash: bind: warning: line editing not enabled
: bash: bind: warning: line editing not enabled
: bash: bind: warning: line editing not enabled
: bash: bind: warning: line editing not enabled
: direnv: unloading
: $ $ $ $

Test session

+ The =line editing not enabled= warning may be causing problems.
+ The process may emit some weird control characters, so maybe this won't work.

#+begin_src sh :session *spi* :eval no :results output verbatim
rkdeveloptool -h | tr -d '\r'
#+end_src

#+RESULTS:
#+begin_example
---------------------Tool Usage ---------------------
Help:                   -h or --help
Version:                -v or --version
ListDevice:             ld
DownloadBoot:           db <Loader>
UpgradeLoader:          ul <Loader>
ReadLBA:                rl  <BeginSec> <SectorLen> <File>
WriteLBA:               wl  <BeginSec> <File>
WriteLBA:               wlx  <PartitionName> <File>
WriteGPT:               gpt <gpt partition table>
WriteParameter:         prm <parameter>
PrintPartition:         ppt
EraseFlash:             ef
TestDevice:             td
ResetDevice:            rd [subcode]
ReadFlashID:            rid
ReadFlashInfo:          rfi
ReadChipInfo:           rci
ReadCapability:         rcb
PackBootLoader:         pack
UnpackBootLoader:       unpack <boot loader>
TagSPL:                 tagspl <tag> <U-Boot SPL>
-------------------------------------------------------
#+end_example
